Revit 2026 API

# FrameOrigin Property

---

The frame's base point.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Origin { get; set; }
```
```vb
Public Property Origin As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ Origin {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member Origin : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

Frame Class

Autodesk.Revit.DB Namespace